---
kind: type
id: T:Autodesk.Revit.DB.Electrical.AreaBasedLoadType
source: html/2800f280-409f-083d-5b57-127a19344de9.htm
---
# Autodesk.Revit.DB.Electrical.AreaBasedLoadType

This class represents an area based load type in Autodesk Revit.

## Syntax (C#)
```csharp
public class AreaBasedLoadType : Element
```